"""
Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя
 несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

name = 'Alexey'
surname = 'Ermolaev'
age = 32

print('Преподаватель ' + ' ' + name + ' ' + surname + ', возраст ' + str(age) + ' года.')

new_name = input('Введите ваше имя')
new_surname = input('Введите вашу фамилию')
new_age = input('Ваш возраст')


print('Новый студент ' + new_name + ' ' + new_surname + ' возраст ' + new_age + ' зарегистрирован.')
